src/main/java/compilador/Scanner.org
#+property: header-args :tangle Scanner.java :comments link

* imports
#+begin_src java :noweb-ref imports
package compilador;

import java.text.ParseException;
import java.util.ArrayList;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;
#+end_src

* scanner
- Which exceptions should be thrown? Myb create a custom one
- ArrayList initial capacity is 10. It maybe should set higher.
#+begin_src java :noweb-ref Scanner
class Scanner {
    public enum Keywords {};

    public static List<String> tokenize(String code) throws ParseException {
        Pattern pattern = Pattern.compile("\\d+");
        Matcher matcher = pattern.matcher(code);
        List<String> matches = new ArrayList<String>();
        while (matcher.find()) {
            matches.add(matcher.group());
        }
        return matches;
    }
}
#+end_src

#+begin_src java :tangle no
    if (matches.length == 0) {
        throw ParseException("Code could not be parsed.", matcher.end());
    }
#+end_src
** tokenizer
#+begin_src
[a-zA-Z_]
/^
(\w+ )+ # keyword in var/function declaration
 +
(IDENTIFIER) # varname
 *
(= *(?EXPR))
;$
/
#+end_src
